{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "binary_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.4", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "batch_input_shape": [null, 369], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [369, 200], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [200], "name": "dense_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [200, 50], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [50], "name": "dense_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [50, 1], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_3/bias"}]}]}